In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn import linear_model
from word2number import w2n

In [4]:
df = pd.read_csv('/home/mtv/Roopsingh/excel_file/hiring.csv')
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [6]:
df['experience'].fillna('zero',inplace=True)

In [7]:
df['experience']

0      zero
1      zero
2      five
3       two
4     seven
5     three
6       ten
7    eleven
Name: experience, dtype: object

In [8]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [9]:
exp = np.array(df['experience'])
exp

array(['zero', 'zero', 'five', 'two', 'seven', 'three', 'ten', 'eleven'],
      dtype=object)

In [17]:
r = w2n.word_to_num('zero')
r

0

In [18]:
num = list()
def convert_text_to_number(text_num):
    for i in text_num:
        # print(i)
        temp = w2n.word_to_num(str(i))
        num.append(temp)
    return num

In [19]:
print_result = convert_text_to_number(exp)
print_result

[0, 0, 5, 2, 7, 3, 10, 11]

In [20]:
df['experience']=print_result

In [21]:
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    NaN                           7      72000
7          11                    7.0                           8      80000

In [24]:
df['test_score(out of 10)'].fillna(df['test_score(out of 10)'].median(),inplace=True)

In [25]:
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    8.0                           7      72000
7          11                    7.0                           8      80000

In [32]:
test_score = df['test_score(out of 10)']
interview_score = df['interview_score(out of 10)']
salary = df['salary($)']

experience = np.array(df.experience).reshape(-1,1)
test_score = np.array(test_score).reshape(-1,1)
interview_score = np.array(interview_score).reshape(-1,1)
salary = np.array(salary).reshape(-1,1)

In [33]:
reg = linear_model.LinearRegression()
reg.fit(df[['experience','test_score(out of 10)','interview_score(out of 10)']],df[['salary($)']])

LinearRegression()

In [34]:
reg.predict([[2,9,6]])

/home/mtv/.local/lib/python3.8/site-packages/sklearn/base.py:464: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([[53205.96797671]])

In [35]:
reg.predict([[12,10,10]])

/home/mtv/.local/lib/python3.8/site-packages/sklearn/base.py:464: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([[92002.18340611]])